import "./style/TaskTwo.css";

export const TaskTwo = () => {
  return (
    <div className="task-two">
      <h1 className="task-two__header">Фронтенд и бэкенд</h1>
      <p>
        Фронтенд (англ. front-end) — клиентская сторона пользовательского
        интерфейса к программно-аппаратной части сервиса. Бэкенд (англ.
        back-end) — программно-аппаратная часть сервиса. Бэкенд отвечает за
        осуществление функционирования внутренней части веб-сайта. Фронт- и
        бэкенд — это вариант архитектуры программного обеспечения. Термины
        появились в программной инженерии вследствие развития принципа
        разделения ответственности между внешним представлением и внутренней
        реализацией.
      </p>
    </div>
  );
};
